[{"name":"memory_limit","suggested":"120","documentation":"This sets the maximum amount of memory in bytes that a script is allowed to allocate. This helps prevent poorly written scripts for eating up all available memory on a server. It is recommended to set this as low as possible and avoid removing the limit."},{"name":"max_execution_time","suggested":"90","documentation":"This sets the maximum amount of time, in seconds, that a script is allowed to run. The lower the value, the better for the server, but also, the better has the script to be written. Avoid really large values that are only useful for admin, and set them per directory."},{"name":"expose_php","suggested":"Off","documentation":"Exposes to the world that PHP is installed on the server. For security reasons, it is better to keep this hidden."},{"name":"display_errors","suggested":"Off","documentation":"This determines whether errors should be printed to the screen as part of the output or if they should be hidden from the user."},{"name":"error_reporting","suggested":"E_ALL","documentation":"Set the error reporting level. Always set this high, so as to have the errors reported, and logged."},{"name":"log_errors","suggested":"On","documentation":"Always log errors for future use"},{"name":"error_log","suggested":"Name of a writable file, suitable for logging.","documentation":"Name of the file where script errors should be logged. "},{"name":"realpath_cache_size","suggested":"128k","documentation":"Determines the size of the realpath cache to be used by PHP. The default value of \"16k\" is usually too low for modern application that open many files (autoload, fopen, filet_get_contents...). It is recommended to make this value up to 128 to 256k, and reduce it by testing with realpath_cache_get()."},{"name":"realpath_cache_ttl","suggested":"3600","documentation":"Duration of time (in seconds) for which to cache realpath information for a given file or directory. If the application's code doesn't change too often, you may set this directive to 3600 (one hour) or even more."},{"name":"Extra configurations","suggested":"&nbsp;","documentation":"<a href=\"http:\/\/php.net\/manual\/en\/info.configuration.php\">Standard runtime configuration<\/a>"}]